ptb/1cbuh/webs/InformationRegisters/Request.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Request</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Users</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RowFromHttp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>FullRowStr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>UnixTimestamp</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ptb/1cbuh/webs/InformationRegisters/ОшибкиНаСтроне.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиНаСтроне</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходнаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПолныйJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяUnix</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТекущийПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ptb/1cbuh/webs/CommonModules/ОбщийДляРегистраСведений/Ext/Module.bsl
Процедура ДобавитьВРегистр(Пользователь,ПервыйПараметр,СтрокаЗапроса) Экспорт  
	/// Ускорения просто пишем. нужна история входящих пакетов
	МенеджерЗаписи = РегистрыСведений.Request.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Users = Пользователь;
	МенеджерЗаписи.UnixTimestamp=ОбщиеДляВремени.ВUnixTime();
	МенеджерЗаписи.FrisrtRowHttp = ПервыйПараметр;
	МенеджерЗаписи.FullRowStr = СтрокаЗапроса;
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

/// Добавление в РС ОшибкиНаСтроне 
/// Без отбора для скорости записи
Процедура ДобавитьВОшибкиНаСтроне(СтруктураДляДобавления, ПолныйJSON) Экспорт 
	// Справедливотсти ради считаем что запись идет по трем ключас и совпадения не возможны
	МенеджерЗаписи = РегистрыСведений.ОшибкиНаСтроне.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Клиент = СтруктураДляДобавления.Client;
	МенеджерЗаписи.ВремяUnix = ОбщиеДляВремени.ВUnixTime(ТекущаяДата());
	МенеджерЗаписи.ТекущийПользователь = СтруктураДляДобавления.UserName;
	МенеджерЗаписи.ИмяМодуля = СтруктураДляДобавления.ModuleName;
	МенеджерЗаписи.ИсходнаяСтрока = СтруктураДляДобавления.SourceString;
	МенеджерЗаписи.СтрокаНомер = СтруктураДляДобавления.NumberRow;
	МенеджерЗаписи.Описание = СтруктураДляДобавления.Description;
	МенеджерЗаписи.ВерсияПриложения = СтруктураДляДобавления.PlatformVersion;
	МенеджерЗаписи.ДатаПолучения = ТекущаяДата();
	МенеджерЗаписи.ДатаОтправки = СтруктураДляДобавления.DateSend;
	МенеджерЗаписи.ПолныйJSON = ПолныйJSON;
	Попытка	
		МенеджерЗаписи.Записать()
    Исключение
        ЗаписьЖурналаРегистрации("ДобавитьВОшибкиНаСтроне", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при записи  " + ОписаниеОшибки());
    КонецПопытки;	

КонецПроцедуры
